[
  
    {
      "title": "Project One",
      "subtitle": "Reason for developing Project One, what does it solve?",
      "live": "www.project1.com",
      "src": "www.github.com/matthewpkearney/url",
      "dates": "Jan 2021",
      "tags": ["PL1", "PL2", "Concept1", "Method1"],
      "show": true,
      "month": 1,
      "year": 2021
    },
    {
      "title": "Maintenance Technician at Apex Green Roofs in Newbury, MA",
      "subtitle": "Aiding in the construction of green roof systems on commercial and residential builds across the northeastern US. Fulfilling maintenance operations on construction projects to aid with plant acclimations across various roof microclimates.",
      "live": "",
      "src": "",
      "dates": "",
      "tags": ["Sustainable architecture", "Construction implementation" , "Maintenance operations", "SOP documentation", "Power tools"],
      "show": true,
      "month": [10, 13],
      "year": 2025
    },
    {
      "title": "Grounds Member at Shady Hill Greenhouses and Nursery in Londonderry, NH",
      "subtitle": "Assisting in business operations tasks involving landscape and hardscape design, plant care and growth, maintaining irrigation processes, and greenhouse maintenance.",
      "live": "",
      "src": "",
      "dates": "",
      "tags": ["Irrigation design", "Agriculture technology", "Power tools"],
      "show": true,
      "month": [7, 10],
      "year": 2025
    },
     {
      "title": "Backend Developer at Davidson Laboratory for Erosion Forecasting over NJ in Hoboken, NJ",
      "subtitle": "Working with 4 peers to create a storm erosion modeling application for detailing, classifying, and advancing dune erosion metrics within weather forecasting systems. I lead the design of the backend system using MATLAB as well as AWS services to model erosion 4 times a day over 13 segments of the New Jersey shore.",
      "live": "",
      "src": "",
      "dates": "",
      "tags": ["Ocean modeling", "ETL design", "MATLAB", "AWS", "Bash"],
      "show": true,
      "month": [9, 5],
      "year": [2024, 2025]
    },
    {
      "title": "Course Assistant for Security, Privacy, and Society (CS 396) in Hoboken, NJ",
      "subtitle": "Motivating students under the need for developing proactive cybersecurity systems. Topics included cryptography, common attack structures and countermeasures of web and network security, and societal discourse of recurring privacy and security concerns due to technology. Administering weekly lab material for a class of 31 students, grading exams and essays, and proctoring students with time accomodations.",
      "live": "",
      "src": "",
      "dates": "Fall 2024",
      "tags": ["Course administration", "Material development", "Student assessment"],
      "show": true,
      "month": [9, 12],
      "year": 2024
    }, 
    {
      "title": "Fellow at Sustainable and Just Futures\nHoboken, NJ",
      "subtitle": "Initiative to improve the environmental and sustainabilty education, status, and attitude at Stevens, and in education beyond. Working with SJF at UCB and other universities around the US, as well as other departments and student leads at Stevens to address the need to invest in greater envionmental education and youth action.",
      "live": "",
      "src": "",
      "dates": "",
      "tags": ["Environmental advocacy", "Event organization"],
      "show": false,
      "month": [8, 13],
      "year": 2024
    },
    {
      "title": "Research Assistant at Davidson Laboratory (SFAS) in Hoboken, NJ",
      "subtitle": "Working with a team of model developers for the Stevens Flood Advisory System (SFAS) to navigate ensemble members for flood and hydrological modeling of the NYC harbor, and rivers and estuaries across the northeast. Developed a meteorological product description document for 20+ meteorological products, leading to improvements in spatial and temporal resolutions for ensemble members and deeper foresight for future direction to advance the model. ",
      "live": "",
      "src": "",
      "dates": "",
      "tags": ["Ocean modeling", "Meteorology", "Documentation"],
      "show": true,
      "month": [5, 9],
      "year": 2024
    }, 
    {
      "title": "Sales Associate at Best Buy in Secaucus, NJ",
      "subtitle": "Developing relations with and matching the needs of customers in computing sales. Maintaining clear displays. ",
      "live": "",
      "src": "",
      "dates": "",
      "tags": ["Customer relations", "Sales representation", "Technology advising"],
      "show": true,
      "month": [6, 8],
      "year": 2024
    },
    {
      "title": "Hospitality Specialist / Front-end development at NHC Events at Searles Castle in Windham, NH",
      "subtitle": "Created a web development proposal to create a digital storefront that meets industry and client standards. Performed hospitality services from geuridon serving to passing hors d'ouvres. ",
      "live": "",
      "src": "",
      "dates": "",
      "tags": ["Patron assistance", "Crown and safety management", "Geuridon serving"],
      "show": true,
      "month": [6, 8],
      "year": 2023
    }, 
    {
      "title": "Course Assistant for Introduction to Computer Science (CS 115) in Hoboken, NJ",
      "subtitle": "Motivating and assisting an introductory computer science course for students learning Python and programming fundamentals. Provided help to 19 students through course material and labs to support skills including recursion and troubleshooting",
      "live": "",
      "src": "",
      "dates": "",
      "tags": ["Material development", "Course advising"],
      "show": true,
      "month": [9, 12],
      "year": 2022
    }, 
    {
      "title": "Server / Food Stand Leader at Canobie Lake Park in Salem, NH",
      "subtitle": "Restaurant leader, server, and bartender for the Sons of Liberty Tavern.",
      "live": "",
      "src": "",
      "dates": "",
      "tags": ["Food quality assurance", "Customer relations", "Store and safety management"],
      "show": true,
      "month": [5, 8],
      "year": 2022
    }, 
    {
      "title": "Research Assistant for doctoral Thesis in Hoboken, NJ",
      "subtitle": "Experimentation on 3D projection technology, making observations from model iterations of simulations onto angled surfaces.",
      "live": "",
      "src": "",
      "dates": "",
      "tags": ["Experimental model creation"],
      "show": true,
      "month": [9, 11],
      "year": 2021
    }, 
    {
      "title": "Warehouse worker at Canobie Lake Park in Salem, NH",
      "subtitle": "Fulfilling warehouse operations across maintenance, transportation, and loading tasks",
      "live": "",
      "src": "",
      "dates": "",
      "tags": ["Stock delivery and management", "Food storage and FIFO stock rotation"],
      "show": true,
      "month": [6, 8],
      "year": 2021
    }

    
]